// З клавіатури вводиться ціна товару і кількість грошей. Якщо грошей
// не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються
// гроші, то пропонуємо купити лотерею за 4 грн.

const productPrice = parseFloat(
    prompt("Введіть будь ласка ціну товару, який вас цікавить", "")
);
const moneyAmount = parseFloat(
    prompt("Введіть будь ласка яка кількість грошей у вас зараз є", "")
);

if (productPrice > moneyAmount)
    document.write(
        "Вибачте, але вам не вистачає коштів для покупки даного товару."
    );
else if (moneyAmount - productPrice >= 4)
    document.write(
        "Вітаємо, ви можете придбати цей товар! Окрім цього в можете придбати лотерейний квиток за 4 грн і випробувати свою вдачу."
    );
else {
    document.write("Вітаємо, ви можете придбати цей товар!");
}
