//  Каса. Користувачу повідомляють суму, яку йому треба
//  сплатити. Користувач поступово вводить суму грошей до тих
//  пір, поки суми не буде достатньо для оплати товарів (кожного
//  разу користувачу повідомляють, яку ще суму потрібно ввести).

const amountPayable = parseInt(
    prompt("Введіть будь ласка суму яку треба сплатити.", "")
)

let acc = 0

for (let i = 0; ; i++) {
    let payment = parseInt(
        prompt(
            `Вітаю! Вам необхідно сплатити ${
                amountPayable - acc
            } грн. Яку кількість коштів ви готові зараз внести?`
        )
    )
    acc += payment

    if (amountPayable - acc <= 0) break
}

document.write("Вітаю! Ви сплатили всю суму покупки")
