// Морський бій. Ворожий корабель, може знаходитись в одному із
// квадратів (кількість квадратів вводиться з клавіатури), які
// розташовані лінійно (один за одним) на річці. Позиція корабля
// визначається комп’ютером випадковим чином. Гра відбувається за
// правилами:
// 1) якщо користувач стріляє у заданий квадрат (тобто
// вводиться номер квадрата), то корабель потоплено;
// 2) якщо корабель знаходиться у сусідньому по відношенню до квадрата, де
// знаходиться корабель, то корабель пошкоджено (про це повідомляємо
// користувача).
// За два постріли спробувати потопити корабель.

const squareNumbers = parseInt(
    prompt("Введіть будь ласка кількість квадратів для гри", "")
)
let userNumber = parseInt(
    prompt("Введіть будь ласка у який квадрат ви хотіли б поцілити", "")
)

const minNumber = 1
const maxNumber = squareNumbers

const randomNumber = minNumber + Math.floor(Math.random() * maxNumber)

let result

if (userNumber === randomNumber) result = "Ви потопили корабель!"
else if (userNumber - randomNumber === 1 || randomNumber - userNumber === 1) {
    userNumber = parseInt(
        prompt(
            "Ви влучили у корабель! Введіть будь ласка у який наступний квадрат ви хотіли б поцілити",
            ""
        )
    )
    if (userNumber === randomNumber) result = "Ви потопили корабель!"
    else
        result =
            "Нажаль ви не змогли потопити корабель. Корабль знаходився у квадраті ${randomNumber}"
} else {
    userNumber = parseInt(
        prompt(
            "Нажаль ви не влучили у корабель. У вас є ще одна спроба, напишіть будь ласка у який наступний квадрат ви хотіли б поцілити",
            ""
        )
    )
    if (userNumber === randomNumber) result = "Ви потопили корабель!"
    else
        result = `Нажаль ви не змогли потопити корабель. Корабль знаходився у квадраті ${randomNumber}`
}

document.write(result)
